[
    {
        "title": "NBA Draft Recommender and Player Guesser",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A full-stack web app built for DataHacks 2025 featuring an NBA draft recommender and Akinator-style legend guessing game, using React, Next.js, and machine learning on live NBA stats."
    },
    {
        "title": "League of Legends Role Analysis and Predictor",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A machine learning project analyzing 97,980 rows of pro League of Legends data to compare role impact and predict player roles using a random forest classifier with 69.89% accuracy."
    },
    {
        "title": "Processed Levels of Food Between Grocery Stores Visualization",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A data visualization project comparing levels of processed foods across grocery stores, highlighting nutritional differences through clear and engaging visual analysis."
    },
    {
        "title": "Handwritten Digit Classifier (KNN + MNIST)",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A handwritten digit classifier using K-Nearest Neighbors on the MNIST dataset, achieving high accuracy in image recognition through feature comparison and distance metrics."
    },
    {
        "title": "Minigit",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A simplified Git-like version control system built in Java with CLI support, featuring staging, branching, SHA-1-based object storage, and robust JUnit-tested version tracking."
    },
    {
        "title": "PM2.5 Emissions Comparison of Vehicle Types in Urban India Analysis",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A data analysis project comparing PM2.5 emissions across vehicle types in urban India, highlighting key contributors to air pollution using visualizations and statistical insights."
    },
    {
        "title": "Horror Puzzle Game",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A 2D puzzle platformer with jumpscares built in Unity, featuring custom shaders, showcased to 60+ attendees at the Video Game Development Club open house.."
    },
    {
        "title": "Parkour Fury",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A 2D platformer game built with Python Arcade, featuring accurate collision mechanics and 100+ interactive sprites, awarded Best Beginner Project out of 20+ teams at Leland Hacks."
    },
    {
        "title": "Dungeon Escape Platformer Game",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A 2D platformer game built in Unity with C#, featuring precise mouse-controlled aiming and interactive tile-based environments, showcased to 200+ attendees at a UCLA gallery."
    },
    {
        "title": "At autem nam aliquam.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Voluptatem aliquid, nemo laborum necessitatibus quisquam quas consequatur atque qui, minus adipisci asperiores accusamus minima tenetur quasi eum nihil mollitia tempora voluptate? Molestiae illo magnam rem quidem doloremque totam. Facilis."
    },
    {
        "title": "Ratione assumenda quam qui!",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Voluptatibus architecto corporis voluptatum in, reprehenderit assumenda voluptates nihil asperiores possimus dolorem sapiente, hic modi maiores fuga provident nostrum excepturi, tenetur omnis et? Officiis laudantium ea nostrum dolorem, harum doloremque."
    },
    {
        "title": "Obcaecati quisquam eaque tempora.",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Velit deserunt iste consectetur ratione nisi consequatur possimus, vel exercitationem enim eaque fugiat est voluptate. Itaque sint recusandae vel in aperiam natus veniam quasi placeat, ab explicabo unde alias pariatur."
    }
]